; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v13 ?v7)
             (pred_7 ?v1 ?v8)
             (pred_6 ?v13 ?v8)
             (pred_2 ?v4 ?v13 )
	     (pred_8 ?v13)
             (pred_11 ?v12)
             (pred_10 ?v1)
             (pred_5 ?v8)
             (pred_3 ?v13)
             (pred_4 ?v1)
             (pred_1 ?v13)
             (pred_9 ))



(:action op_3
:parameters (?v6 ?v2 ?v11 ?v3)
:precondition (and (pred_11 ?v6) (pred_11 ?v2) (pred_10 ?v11) (pred_5 ?v3)
          (pred_12 ?v6 ?v2) (pred_7 ?v11 ?v3)
                   (pred_6 ?v2 ?v3) (pred_8 ?v6) 
                   (pred_3 ?v2) (pred_4 ?v11))
:effect (and  (pred_1 ?v2) (not (pred_3 ?v2))))


(:action op_5
:parameters (?v6 ?v10)
:precondition (and (pred_11 ?v6) (pred_11 ?v10)
               (pred_8 ?v6) (pred_12 ?v6 ?v10) (pred_1 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v6))))

(:action op_1
:parameters (?v6 ?v11)
:precondition (and (pred_11 ?v6) (pred_10 ?v11) 
                  (pred_8 ?v6) (pred_2 ?v11 ?v6) (pred_9 ))
:effect (and (pred_4 ?v11)
   (not (pred_2 ?v11 ?v6)) (not (pred_9 ))))


(:action op_2
:parameters (?v6 ?v9 ?v5)
:precondition (and (pred_11 ?v6) (pred_10 ?v9) (pred_10 ?v5)
                  (pred_8 ?v6) (pred_4 ?v5) (pred_2 ?v9 ?v6))
:effect (and (pred_4 ?v9) (pred_2 ?v5 ?v6)
        (not (pred_4 ?v5)) (not (pred_2 ?v9 ?v6))))

(:action op_4
:parameters (?v6 ?v11)
:precondition (and (pred_11 ?v6) (pred_10 ?v11) 
                  (pred_8 ?v6) (pred_4 ?v11))
:effect (and (pred_9 ) (pred_2 ?v11 ?v6) (not (pred_4 ?v11)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_20 obj_17 obj_01 obj_21 obj_08 obj_19 obj_09 obj_05 obj_14 obj_13 obj_03 obj_07 obj_10 obj_02 obj_11 obj_04
    obj_06 obj_16
    obj_15 obj_18 obj_12
    )

    (:init
       (pred_9)

       (pred_11 obj_20)
       (pred_11 obj_17)
       (pred_11 obj_01)
       (pred_11 obj_21)
       (pred_11 obj_08)
       (pred_11 obj_19)
       (pred_11 obj_09)
       (pred_11 obj_05)
       (pred_11 obj_14)
       (pred_11 obj_13)
       (pred_11 obj_03)
       (pred_11 obj_07)
       (pred_11 obj_10)
       (pred_11 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_04)
       (pred_5 obj_06)
       (pred_5 obj_16)
       (pred_10 obj_15)
       (pred_10 obj_18)
       (pred_10 obj_12)

       (pred_12 obj_20 obj_08)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_17 obj_19)
       (pred_12 obj_17 obj_01)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_01 obj_09)
       (pred_12 obj_01 obj_21)
       (pred_12 obj_01 obj_17)
       (pred_12 obj_21 obj_05)
       (pred_12 obj_21 obj_01)
       (pred_12 obj_08 obj_14)
       (pred_12 obj_08 obj_19)
       (pred_12 obj_08 obj_20)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_19 obj_09)
       (pred_12 obj_19 obj_17)
       (pred_12 obj_19 obj_08)
       (pred_12 obj_09 obj_03)
       (pred_12 obj_09 obj_05)
       (pred_12 obj_09 obj_01)
       (pred_12 obj_09 obj_19)
       (pred_12 obj_05 obj_07)
       (pred_12 obj_05 obj_21)
       (pred_12 obj_05 obj_09)
       (pred_12 obj_14 obj_10)
       (pred_12 obj_14 obj_13)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_13 obj_02)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_13 obj_14)
       (pred_12 obj_03 obj_11)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_03 obj_09)
       (pred_12 obj_03 obj_13)
       (pred_12 obj_07 obj_04)
       (pred_12 obj_07 obj_05)
       (pred_12 obj_07 obj_03)
       (pred_12 obj_10 obj_02)
       (pred_12 obj_10 obj_14)
       (pred_12 obj_02 obj_11)
       (pred_12 obj_02 obj_13)
       (pred_12 obj_02 obj_10)
       (pred_12 obj_11 obj_04)
       (pred_12 obj_11 obj_03)
       (pred_12 obj_11 obj_02)
       (pred_12 obj_04 obj_07)
       (pred_12 obj_04 obj_11)
       (pred_3 obj_03)
       (pred_3 obj_04)
       (pred_3 obj_21)
       (pred_6  obj_03 obj_06)
       (pred_6  obj_04 obj_16)
       (pred_6  obj_21 obj_06)
       (pred_1 obj_20)
       (pred_1 obj_17)
       (pred_1 obj_01)
       (pred_1 obj_08)
       (pred_1 obj_19)
       (pred_1 obj_09)
       (pred_1 obj_05)
       (pred_1 obj_14)
       (pred_1 obj_13)
       (pred_1 obj_07)
       (pred_1 obj_10)
       (pred_1 obj_02)
       (pred_1 obj_11)

       (pred_7  obj_15 obj_06)
       (pred_7  obj_18 obj_16)
       (pred_7  obj_12 obj_16)
       (pred_2 obj_15 obj_02)
       (pred_2 obj_18 obj_09)
       (pred_2 obj_12 obj_19)
       (pred_8 obj_07)
    )

    (:goal (and
       (pred_2 obj_18 obj_11)
    ))
(:constraints
  (always (not (pred_8 obj_13)))
)
)

; plan
1. (op_5 obj_07 obj_05)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_05)
   goals met: 0 of 1
2. (op_5 obj_05 obj_09)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_09)
   goals met: 0 of 1
3. (op_1 obj_09 obj_18)
   deleted: (pred_2 obj_18 obj_09) (pred_9)
   added: (pred_4 obj_18)
   goals met: 0 of 1
4. (op_5 obj_09 obj_05)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_05)
   goals met: 0 of 1
5. (op_5 obj_05 obj_07)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_07)
   goals met: 0 of 1
6. (op_3 obj_07 obj_04 obj_18 obj_16)
   deleted: (pred_3 obj_04)
   added: (pred_1 obj_04)
   goals met: 0 of 1
7. (op_5 obj_07 obj_04)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_04)
   goals met: 0 of 1
8. (op_5 obj_04 obj_11)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_11)
   goals met: 0 of 1
9. (op_4 obj_11 obj_18)
   deleted: (pred_4 obj_18)
   added: (pred_9) (pred_2 obj_18 obj_11)
   goals met: 1 of 1
